src/InformationRegisters/РезультатыСинтаксическойПроверки/РезультатыСинтаксическойПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыСинтаксическойПроверки</name>
  <resources>
    <name>КоличествоОшибокАПК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПровереноАПК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибокBSL_LS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПровереноBSLLS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектПроверки</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьУведомленийСинтаксическойПроверки/ОчередьУведомленийСинтаксическойПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьУведомленийСинтаксическойПроверки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОперацийУведомлений</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектПроверки</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>CatalogRef.ВерсииДополнений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоПроверкаАПК</name>
    <comment>Маркер вида проверки. АПК или БСЛ-ЛС. Если Истина, то АПК.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыОперацийУведомлений/СтатусыОперацийУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОперацийУведомлений</name>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/РезультатыСинтаксическойПроверки/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	ЭтоНаборУдаления = Количество() = 0; 
	Если ЭтоНаборУдаления Тогда
		ДополнительныеСвойства.Вставить("БылоУдаление");
	КонецЕсли;
	
	Если ЭтоНаборУдаления Или Не ДополнительныеСвойства.Свойство("БылоУдаление") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РезультатыСинтаксическойПроверки.ПровереноBSLLS КАК ПровереноBSLLS,
			|	РезультатыСинтаксическойПроверки.ПровереноАПК КАК ПровереноАПК
			|ИЗ
			|	РегистрСведений.РезультатыСинтаксическойПроверки КАК РезультатыСинтаксическойПроверки
			|ГДЕ
			|	РезультатыСинтаксическойПроверки.ОбъектПроверки = &ОбъектПроверки";
		Запрос.УстановитьПараметр("ОбъектПроверки", Отбор.ОбъектПроверки.Значение);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.ПровереноBSLLS Тогда
				ДополнительныеСвойства.Вставить("БылоПровереноBSLLS");
			КонецЕсли;
			Если Выборка.ПровереноАПК Тогда
				ДополнительныеСвойства.Вставить("БылоПровереноАПК");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если Количество() = 1 И Не ДополнительныеСвойства.Свойство("БылоПровереноBSLLS") И ЭтотОбъект[0].ПровереноBSLLS Тогда
		Менеджер = РегистрыСведений.ОчередьУведомленийСинтаксическойПроверки.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДатаСеанса();
		Менеджер.ОбъектПроверки = ЭтотОбъект[0].ОбъектПроверки;
		Менеджер.ЭтоПроверкаАПК = Ложь;
		Менеджер.Статус = Перечисления.СтатусыОперацийУведомлений.ВОчереди;
		Менеджер.Записать(Ложь);
	КонецЕсли;	
	Если Количество() = 1 И Не ДополнительныеСвойства.Свойство("БылоПровереноАПК") И ЭтотОбъект[0].ПровереноАПК Тогда
		Менеджер = РегистрыСведений.ОчередьУведомленийСинтаксическойПроверки.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДатаСеанса();
		Менеджер.ОбъектПроверки = ЭтотОбъект[0].ОбъектПроверки;
		Менеджер.ЭтоПроверкаАПК = Истина;
		Менеджер.Статус = Перечисления.СтатусыОперацийУведомлений.ВОчереди;
		Менеджер.Записать(Ложь);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
